app/controllers/admin/resources_controller.rb

SELECT "resources".* FROM "resources" ORDER BY activeFrom desc
---
  def index
    @assets = Resource.all

SELECT "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @asset = Resource.find(params[:id])

SELECT "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT 1  [["id", "3"]]
---
  def show
    @asset = Resource.find(params[:id])