app/controllers/assets_controller.rb

SELECT "assets".* FROM "assets" WHERE "assets"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @asset = Asset.find(params[:id])