app/controllers/assets_controller.rb

  def index
    @assets = Asset.all
---
SELECT "assets".* FROM "assets"

  def show
    @asset = Asset.find(params[:id])
---
SELECT "assets".* FROM "assets" WHERE "assets"."id" = ? LIMIT 1  [["id", "NEW"]]

  def create
    @asset = Asset.new(asset_params)

    respond_to do |format|
      if @asset.save
---
INSERT INTO "assets" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 07 Jun 2014 02:48:31 UTC +00:00], ["text", "resource"], ["title", "title"], ["updated_at", Sat, 07 Jun 2014 02:48:31 UTC +00:00]]

  def update
    respond_to do |format|
      if @asset.update(asset_params)
---
UPDATE "assets" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "assets"."id" = 3  [["title", "now some content"], ["text", "hi"], ["updated_at", Sat, 07 Jun 2014 04:27:57 UTC +00:00]]

  def destroy
    @asset.destroy
---
DELETE FROM "assets" WHERE "assets"."id" = ?  [["id", 7]]