app/controllers/resources_controller.rb

  def index
    @assets = Resource.where(nil)
    @assets = @assets.oidTest(params[:oid]) if params[:oid].present?
    @assets = @assets.urlTest(params[:retrievalurl]) if params[:retrievalurl].present?
    @assets = @assets.objectTypeTest(params[:objecttype]) if params[:objecttype].present?
---
SELECT "resources".* FROM "resources" WHERE "resources"."oid" = '45' ORDER BY "resources"."oid" ASC
SELECT "resources".* FROM "resources" ORDER BY "resources"."oid" ASC
SELECT "resources".* FROM "resources" WHERE "resources"."oid" IS NULL AND "resources"."objecttype" IS NULL ORDER BY "resources"."oid" ASC

  def findbyoid
    @asset = Resource.findbyoid(params[:oid])
---
SELECT "resources".* FROM "resources" WHERE "resources"."oid" = '45' LIMIT 1

  def show
    @asset = Resource.find(params[:id])
---
SELECT "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT 1  [["id", "3"]]

  def update
    @asset = Resource.find(params[:id])
    if @asset.update(resource_params)
---
SELECT "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "resources" SET "description" = ?, "updated_at" = ? WHERE "resources"."id" = 3  [["description", "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Praesent consectetur auctor faucibus. Etiam sed mauris lectus. "], ["updated_at", Sun, 08 Jun 2014 03:19:44 UTC +00:00]]

  def destroy
    @asset = Resource.find(params[:id])
    @asset.destroy
---
SELECT "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "resources" WHERE "resources"."id" = ?  [["id", 3]]